import itertools
import pandas as pd
my_list = [['서울고', '중식', '밥,국'], ['평택고', '석식', '밥,국,찌개'], ['서울고', '중식', '밥,국'], ['평택고', '석식', '밥,국,찌개']]


temptemp = [
    ['휘봉고등학교', '20210104', '중식', '현미밥, 청양콩나물국, 청포묵무침, 제육볶음, 배추김치, 귤', '356.7 Kcal'], 
    ['휘경여자고등학교', '20210104', '중식', '옥수수밥, 쇠고기샤브샤브국, 진미채고추장볶음, 치즈불닭, 굴림만두, 깍두기, 자몽데르뜨', '801.3 Kcal'], 
    ['휘경여자고등학교', '20210105', '중식', '흑미밥, 사골조랭이고기만두국, 도토리묵야채무침, 스팸감자구이, 어향동태강정, 배추김치', '935.2 Kcal'], 
    ['휘경공업고등학교', '20210104', '중식', '칼슘강화강낭콩밥, 맑은콩나물국, 시금치나물무침, 닭볶음탕, 어묵피망볶음, 깍두기', '1022.3 Kcal'], 
    ['휘경공업고등학교', '20210105', '중식', '칼슘강화현미밥, 아욱국, 돈등뼈김치찜, 갈릭난*커리소스, 깍두기, 리코타치즈샐러드', '1099.0 Kcal']
]

df = pd.DataFrame(temptemp, columns=['학교명', '날짜', '구분', '메뉴', '칼로리'])
print(df)

file_name = './df.xlsx'
df.to_excel(file_name)

# 학교명, 날짜, 구분, 메뉴, 칼로리

